> @AlexanderBurdenko Could you please share the terraform plan output that showed the recreation plan with us? More details we know about your config, the better we could understand your issue.

the output the same as that provided in similar issues that provided previously
  + resource "azurerm_key_vault_secret" "secret" {
      + id                      = (known after apply)
      + key_vault_id            = ""
      + name                    = "ad-application-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

The problem is:
That you are using Terraform "data resource http" to get API TOKEN for Function App even it doesn't change value at all, but terraform think this is new value, and want to create NEW Secret or New Version of Secret